tutorials/compressible/rhoSimpleFoam/angledDuctExplicitFixedCoeff/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    front
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    back
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    porosityWall
    {
        type            kqRWallFunction;
        value           uniform 1;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
}


// ************************************************************************* //
