tutorials/compressible/rhoSimpleFoam/angledDuctExplicitFixedCoeff/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity
{
    type            explicitPorositySource;
    active          yes;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        porosity;
        type            fixedCoeff;
        active          yes;
        cellZone        porosity;

        fixedCoeffCoeffs
        {
            alpha       (500 -1000 -1000);
            beta        (0 0 0);
            rhoRef      1;

            coordinateSystem
            {
                type    cartesian;
                origin  (0 0 0);
                coordinateRotation
                {
                    type    axesRotation;
                    e1      (0.70710678 0.70710678 0);
                    e2      (0 0 1);
                }
            }
        }
    }
}


fixedTemperature
{
    type            fixedTemperatureConstraint;
    active          yes;

    fixedTemperatureConstraintCoeffs
    {
        selectionMode   cellZone;
        cellZone        porosity;
        mode            uniform;
        temperature     350;
    }
}


porosityTurbulence
{
    type            scalarFixedValueConstraint;
    active          yes;

    scalarFixedValueConstraintCoeffs
    {
        selectionMode   cellZone;
        cellZone        porosity;
        fieldValues
        {
            k           1;
            epsilon     150;
        }
    }
}


// ************************************************************************* //
